; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-6-297)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p2-3 - location
	p0-2 - location
	p4-0 - location
	p4-1 - location
	p4-3 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s0)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s2)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s3)
	(at package2 s2)
	(at package3 s3)
	(at package4 s2)
	(at package5 s4)
	(at package6 s4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 5)
	(= (time-to-walk p2-3 s2) 5)
	(= (time-to-walk s3 p2-3) 4)
	(= (time-to-walk p2-3 s3) 4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 2)
	(= (time-to-walk p0-2 s0) 2)
	(= (time-to-walk s2 p0-2) 5)
	(= (time-to-walk p0-2 s2) 5)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 1)
	(= (time-to-walk p4-0 s4) 1)
	(= (time-to-walk s0 p4-0) 4)
	(= (time-to-walk p4-0 s0) 4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 5)
	(= (time-to-walk p4-1 s4) 5)
	(= (time-to-walk s1 p4-1) 2)
	(= (time-to-walk p4-1 s1) 2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 1)
	(= (time-to-walk p4-3 s4) 1)
	(= (time-to-walk s3 p4-3) 1)
	(= (time-to-walk p4-3 s3) 1)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 3)
	(= (time-to-walk p1-0 s1) 3)
	(= (time-to-walk s0 p1-0) 4)
	(= (time-to-walk p1-0 s0) 4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 4)
	(= (time-to-walk p1-2 s1) 4)
	(= (time-to-walk s2 p1-2) 3)
	(= (time-to-walk p1-2 s2) 3)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 3)
	(= (time-to-drive s0 s1) 3)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 3)
	(= (time-to-drive s2 s1) 3)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 3)
	(= (time-to-drive s0 s2) 3)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 1)
	(= (time-to-drive s3 s2) 1)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 3)
	(= (time-to-drive s4 s2) 3)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 4)
	(= (time-to-drive s0 s3) 4)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 5)
	(= (time-to-drive s1 s3) 5)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 5)
	(= (time-to-drive s1 s4) 5)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 1)
	(= (time-to-drive s3 s4) 1)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at truck2 s2)
	(at truck4 s1)
	(at package1 s4)
	(at package2 s3)
	(at package3 s0)
	(at package4 s2)
	(at package5 s2)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 8
2. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 1 of 8
3. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 8
4. (drive-truck truck2 s0 s2 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 0 to 30
   goals met: 2 of 8
5. (drive-truck truck1 s3 s4 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 30 to 41
   goals met: 2 of 8
6. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 8
7. (drive-truck truck1 s4 s1 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 41 to 91
   goals met: 3 of 8
8. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 4 of 8
9. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 8
10. (drive-truck truck2 s2 s3 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 91 to 102
   goals met: 3 of 8
11. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 4 of 8
12. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 4 of 8
13. (drive-truck truck2 s3 s2 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 102 to 113
   goals met: 5 of 8
14. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 5 of 8
15. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 5 of 8
16. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 8
17. (load-truck package3 truck4 s2)
   deleted: (at package3 s2)
   added: (in package3 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 5 of 8
18. (drive-truck truck4 s2 s4 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   changed: (fuel-used) from 113 to 146
   goals met: 5 of 8
19. (load-truck package5 truck4 s4)
   deleted: (at package5 s4)
   added: (in package5 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 5 of 8
20. (drive-truck truck4 s4 s2 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   changed: (fuel-used) from 146 to 185
   goals met: 5 of 8
21. (unload-truck package5 truck4 s2)
   deleted: (in package5 truck4)
   added: (at package5 s2)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 6 of 8
22. (drive-truck truck4 s2 s0 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 185 to 218
   goals met: 6 of 8
23. (unload-truck package3 truck4 s0)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 7 of 8
24. (drive-truck truck4 s0 s1 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 218 to 248
   goals met: 8 of 8
